<details><summary>Digger run report at 2023-10-10 14:42:43 (UTC)</summary>
  <details><summary>Apply for <b>rimvydascivilis/app-infra#live_staging_k8s-addons</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_iam_policy.cluster_autoscaler[0] will be created
  + resource "aws_iam_policy" "cluster_autoscaler" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "eks-staging-cluster-autoscaler"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "autoscaling:DescribeAutoScalingGroups",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeLaunchConfigurations",
                          + "autoscaling:DescribeScalingActivities",
                          + "ec2:DescribeInstanceTypes",
                          + "ec2:DescribeLaunchTemplateVersions",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "autoscaling:SetDesiredCapacity",
                          + "autoscaling:TerminateInstanceInAutoScalingGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.cluster_autoscaler[0] will be created
  + resource "aws_iam_role" "cluster_autoscaler" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-east-1.amazonaws.com/id/8AED6A08DAB2457C338B576A51CD266D:sub" = "system:serviceaccount:kube-system:cluster-autoscaler"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::039454511521:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/8AED6A08DAB2457C338B576A51CD266D"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-staging-cluster-autoscaler"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.cluster_autoscaler[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_autoscaler" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks-staging-cluster-autoscaler"
    }

  # helm_release.cluster_autoscaler[0] will be created
  + resource "helm_release" "cluster_autoscaler" {
      + atomic                     = false
      + chart                      = "cluster-autoscaler"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "autoscaler"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/autoscaler"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "9.29.3"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "autoDiscovery.clusterName"
          + value = "eks-staging"
        }
      + set {
          + name  = "rbac.serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = (known after apply)
        }
      + set {
          + name  = "rbac.serviceAccount.name"
          + value = "cluster-autoscaler"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_iam_policy.cluster_autoscaler[0]: Creating...
aws_iam_role.cluster_autoscaler[0]: Creating...
aws_iam_policy.cluster_autoscaler[0]: Creation complete after 1s [id=arn:aws:iam::039454511521:policy/eks-staging-cluster-autoscaler]
aws_iam_role.cluster_autoscaler[0]: Creation complete after 1s [id=eks-staging-cluster-autoscaler]
aws_iam_role_policy_attachment.cluster_autoscaler[0]: Creating...
helm_release.cluster_autoscaler[0]: Creating...
aws_iam_role_policy_attachment.cluster_autoscaler[0]: Creation complete after 0s [id=eks-staging-cluster-autoscaler-20231010144335268000000001]
helm_release.cluster_autoscaler[0]: Still creating... [10s elapsed]
helm_release.cluster_autoscaler[0]: Creation complete after 16s [id=autoscaler]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

  ```
</details>
</details>